In [1]:
import pandas as pd

In [52]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [53]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [54]:
a = pd.get_dummies(df.Sex,drop_first = True)
a.head()

   male
0     1
1     0
2     0
3     0
4     1

In [55]:
df = pd.concat([df,a],axis='columns')
df.head(3)

   Pclass     Sex   Age     Fare  Survived  male
0       3    male  22.0   7.2500         0     1
1       1  female  38.0  71.2833         1     0
2       3  female  26.0   7.9250         1     0

In [56]:
df = df.drop(['Sex'],axis=1)
df.head()

   Pclass   Age     Fare  Survived  male
0       3  22.0   7.2500         0     1
1       1  38.0  71.2833         1     0
2       3  26.0   7.9250         1     0
3       1  35.0  53.1000         1     0
4       3  35.0   8.0500         0     1

In [57]:
df.isnull().sum()

Pclass        0
Age         177
Fare          0
Survived      0
male          0
dtype: int64

In [58]:
b = df.Age.mean()
b

29.69911764705882

In [59]:
df.Age.fillna(b,inplace=True)

In [60]:
df.head()

   Pclass   Age     Fare  Survived  male
0       3  22.0   7.2500         0     1
1       1  38.0  71.2833         1     0
2       3  26.0   7.9250         1     0
3       1  35.0  53.1000         1     0
4       3  35.0   8.0500         0     1

In [61]:
df.Age.isnull().sum()

0

In [62]:
df.head()

   Pclass   Age     Fare  Survived  male
0       3  22.0   7.2500         0     1
1       1  38.0  71.2833         1     0
2       3  26.0   7.9250         1     0
3       1  35.0  53.1000         1     0
4       3  35.0   8.0500         0     1

In [64]:
X = df.drop(['Survived'],axis=1)
y = df.Survived

In [65]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.3)

In [66]:
from sklearn.naive_bayes import GaussianNB
reg = GaussianNB()

In [67]:
reg.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [76]:
y_test_pred = reg.predict(X_test)
y_test_pred[0:10]

array([0, 0, 1, 0, 1, 0, 0, 0, 0, 0], dtype=int64)

In [77]:
y_test[0:10]

467    0
145    0
540    1
181    0
303    1
721    0
99     0
421    0
663    0
89     0
Name: Survived, dtype: int64

In [80]:
from sklearn.metrics import accuracy_score

In [81]:
accuracy_score(y_test,y_test_pred)

0.7686567164179104

In [82]:
reg.predict_proba(X_test[:10])

array([[0.74031306, 0.25968694],
       [0.90191555, 0.09808445],
       [0.02561272, 0.97438728],
       [0.92924252, 0.07075748],
       [0.21824101, 0.78175899],
       [0.95832228, 0.04167772],
       [0.92663471, 0.07336529],
       [0.96179376, 0.03820624],
       [0.96648493, 0.03351507],
       [0.96368927, 0.03631073]])

# using cross validation

In [87]:
accuracy_score = []
from sklearn.model_selection import cross_val_score
score = cross_val_score(GaussianNB(),X_train, y_train, cv=5)
accuracy_score.append(score.mean())
accuracy_score

[0.7801290322580645]